DataProcessors/ТаблицаXML_СайтыТребующиеАвтоответаАнкетыНаВопросРегионАбонента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<DataProcessor>
		<Properties>
			<Name>ТаблицаXML_СайтыТребующиеАвтоответаАнкетыНаВопросРегионАбонента</Name>
			<Comment>Если сайт указан, то в анкете первым становится вопрос не после выбора сайта, а после выбора региона. Т.е. это автоответ не на второй, а на третий вопрос</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РегистрСведений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Измерение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ресурс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеИзмерения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЗ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сайт</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ТаблицаXML_СайтыТребующиеАвтоответаАнкетыНаВопросРегионАбонента/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.РегистрСведений 	= ?(ЗначениеЗаполнено(Параметры.РегистрСведений), Параметры.РегистрСведений, Объект.РегистрСведений);
	Объект.Измерение 		= ?(ЗначениеЗаполнено(Параметры.Измерение), Параметры.Измерение, Объект.Измерение);
	Объект.Ресурс			= ?(ЗначениеЗаполнено(Параметры.Ресурс), Параметры.Ресурс, Объект.Ресурс);
	
	Если ЗначениеЗаполнено(Параметры.ЗначениеИзмерения) Тогда
		Объект.ЗначениеИзмерения = Параметры.ЗначениеИзмерения;
		
		//Если при вызове формы параметры заполнены, значит она вызвана не напрямую,
		// т.е. не предполагает изменение этих настроек, поэтому скроем все закладки, кроме "СтрДанные"	
		Элементы.СтрПараметрыТаблицы.Видимость	 = Ложь;
		Элементы.СтрОтладкаСкрыть.Видимость		=Ложь;
	КонецЕсли;
	
	//Установи настройки по умолчанию
	//------------------------------------
	Об = РеквизитФормыВЗначение("Объект");                        
	Об.УстановитьНастройки();
	ЗначениеВРеквизитФормы(Об, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура СформируйСписокВыбора(ИмяОбъектаМетаданных)
	
	Запрос = Новый Запрос("ВЫБРАТЬ Ссылка КАК Ссылка, ПРЕДСТАВЛЕНИЕ(Ссылка) КАК Представление ИЗ Справочник.ТочкиЦелевые ГДЕ НЕ ПометкаУдаления");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Справочник.ТочкиЦелевые", ИмяОбъектаМетаданных);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Элементы.ТЗКолонка2.СписокВыбора.Добавить(Выборка.Ссылка, Выборка.Представление);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	Десериализовать(); 
КонецПроцедуры  

&НаСервере
Процедура Десериализовать()  
	Об = РеквизитФормыВЗначение("Объект");
	Об.Десериализовать();
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры


&НаКлиенте
Процедура Сериализовать(Команда)
	СериализоватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СериализоватьНаСервере()
	Об = РеквизитФормыВЗначение("Объект");
	Об.Сериализовать();
КонецПроцедуры
